docs/notification-benchmark-runs/20260913-192627-b6ec9a92/outbox-like-k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: E:\goProject\library\src\GoStudy\AiDevClub\scripts\notification-benchmark.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 35s max duration (incl. graceful stop):
              * notification_write: 20 looping VUs for 30s (gracefulStop: 5s)


running (01.0s), 20/20 VUs, 15 complete and 0 interrupted iterations
notification_write   [   3% ] 20 VUs  01.0s/30s

running (02.0s), 20/20 VUs, 47 complete and 0 interrupted iterations
notification_write   [   7% ] 20 VUs  02.0s/30s

running (03.0s), 20/20 VUs, 76 complete and 0 interrupted iterations
notification_write   [  10% ] 20 VUs  03.0s/30s

running (04.0s), 20/20 VUs, 105 complete and 0 interrupted iterations
notification_write   [  13% ] 20 VUs  04.0s/30s

running (05.0s), 20/20 VUs, 130 complete and 0 interrupted iterations
notification_write   [  17% ] 20 VUs  05.0s/30s

running (06.0s), 20/20 VUs, 162 complete and 0 interrupted iterations
notification_write   [  20% ] 20 VUs  06.0s/30s

running (07.0s), 20/20 VUs, 193 complete and 0 interrupted iterations
notification_write   [  23% ] 20 VUs  07.0s/30s

running (08.0s), 20/20 VUs, 224 complete and 0 interrupted iterations
notification_write   [  27% ] 20 VUs  08.0s/30s

running (09.0s), 20/20 VUs, 257 complete and 0 interrupted iterations
notification_write   [  30% ] 20 VUs  09.0s/30s

running (10.0s), 20/20 VUs, 285 complete and 0 interrupted iterations
notification_write   [  33% ] 20 VUs  10.0s/30s

running (11.0s), 20/20 VUs, 314 complete and 0 interrupted iterations
notification_write   [  37% ] 20 VUs  11.0s/30s

running (12.0s), 20/20 VUs, 342 complete and 0 interrupted iterations
notification_write   [  40% ] 20 VUs  12.0s/30s

running (13.0s), 20/20 VUs, 371 complete and 0 interrupted iterations
notification_write   [  43% ] 20 VUs  13.0s/30s

running (14.0s), 20/20 VUs, 399 complete and 0 interrupted iterations
notification_write   [  47% ] 20 VUs  14.0s/30s

running (15.0s), 20/20 VUs, 429 complete and 0 interrupted iterations
notification_write   [  50% ] 20 VUs  15.0s/30s

running (16.0s), 20/20 VUs, 460 complete and 0 interrupted iterations
notification_write   [  53% ] 20 VUs  16.0s/30s

running (17.0s), 20/20 VUs, 490 complete and 0 interrupted iterations
notification_write   [  57% ] 20 VUs  17.0s/30s

running (18.0s), 20/20 VUs, 521 complete and 0 interrupted iterations
notification_write   [  60% ] 20 VUs  18.0s/30s

running (19.0s), 20/20 VUs, 552 complete and 0 interrupted iterations
notification_write   [  63% ] 20 VUs  19.0s/30s

running (20.0s), 20/20 VUs, 578 complete and 0 interrupted iterations
notification_write   [  67% ] 20 VUs  20.0s/30s

running (21.0s), 20/20 VUs, 612 complete and 0 interrupted iterations
notification_write   [  70% ] 20 VUs  21.0s/30s

running (22.0s), 20/20 VUs, 642 complete and 0 interrupted iterations
notification_write   [  73% ] 20 VUs  22.0s/30s

running (23.0s), 20/20 VUs, 673 complete and 0 interrupted iterations
notification_write   [  77% ] 20 VUs  23.0s/30s

running (24.0s), 20/20 VUs, 704 complete and 0 interrupted iterations
notification_write   [  80% ] 20 VUs  24.0s/30s

running (25.0s), 20/20 VUs, 735 complete and 0 interrupted iterations
notification_write   [  83% ] 20 VUs  25.0s/30s

running (26.0s), 20/20 VUs, 761 complete and 0 interrupted iterations
notification_write   [  87% ] 20 VUs  26.0s/30s

running (27.0s), 20/20 VUs, 795 complete and 0 interrupted iterations
notification_write   [  90% ] 20 VUs  27.0s/30s

running (28.0s), 20/20 VUs, 824 complete and 0 interrupted iterations
notification_write   [  93% ] 20 VUs  28.0s/30s

running (29.0s), 20/20 VUs, 857 complete and 0 interrupted iterations
notification_write   [  97% ] 20 VUs  29.0s/30s

running (30.0s), 20/20 VUs, 889 complete and 0 interrupted iterations
notification_write   [ 100% ] 20 VUs  30.0s/30s


  █ TOTAL RESULTS 

    checks_total.......: 909     29.60114/s
    checks_succeeded...: 100.00% 909 out of 909
    checks_failed......: 0.00%   0 out of 909

    ✓ like endpoint returns HTTP 200

    CUSTOM
    benchmark_error_rate...........: 0.00%  0 out of 909
    benchmark_request_duration.....: avg=667.91ms min=231.61ms med=715.87ms max=1.44s p(90)=974.63ms p(95)=1.04s p(99)=1.23s
    benchmark_requests.............: 909    29.60114/s

    HTTP
    http_req_duration..............: avg=667.91ms min=231.61ms med=715.87ms max=1.44s p(90)=974.63ms p(95)=1.04s p(99)=1.23s
      { expected_response:true }...: avg=667.91ms min=231.61ms med=715.87ms max=1.44s p(90)=974.63ms p(95)=1.04s p(99)=1.23s
    http_req_failed................: 0.00%  0 out of 909
    http_reqs......................: 909    29.60114/s

    EXECUTION
    iteration_duration.............: avg=668.6ms  min=248.92ms med=716.12ms max=1.47s p(90)=975.08ms p(95)=1.04s p(99)=1.23s
    iterations.....................: 909    29.60114/s
    vus............................: 20     min=20       max=20
    vus_max........................: 20     min=20       max=20

    NETWORK
    data_received..................: 170 kB 5.5 kB/s
    data_sent......................: 283 kB 9.2 kB/s



running (30.7s), 00/20 VUs, 909 complete and 0 interrupted iterations
notification_write ✓ [ 100% ] 20 VUs  30s